[
  {
    "applyText": "Denali Projects offers exciting opportunities for professional growth, allowing individuals to work on elaborate and complex projects that shape the future of the energy industry. With a strong emphasis on collaboration, sustainability, and excellence, employees are empowered to contribute their unique skills and ideas, ensuring a fulfilling and impactful career. Apply at Denali Projects today!",
    "careersText": "text",
    "insideText": "Founded in 2016, Denali Projects Ltd. has been dedicated to delivering top-tier project management and engineering solutions in the energy industry. We prioritize client satisfaction by fostering strong partnerships and delivering projects that meet the highest standards of quality and safety. Our mission is to turn complex challenges into successful outcomes, making us a trusted partner in the EPC industry.",
    "futureTextLine1": "Let's build the future of energy together.",
    "futureTextLine2": "Are you ready to power up your career with a dynamic and innovative company in the energy sector? At Denali Projects, you will work on exciting projects that drive sustainable solutions, collaborate with industry experts, and grow your career in a supportive and forward-thinking environment. If you're passionate about making a real impact and eager to be a part of a company that values creativity, integrity, and excellence, Denali Projects is the perfect place for you.",
    "aboutTextLine1": "Since our inception, Denali Projects has had the pleasure and experience to work with numerous midstreamers and producers in the Western Canadian oil and gas sector. The range of these projects has varied in scope, including FEED studies & routine MOCs to new green field facilities. Denali Projects prides itself on being an efficient and valuable service provider to our clients",
    "aboutTextLine2": "Denali Projects is a great fit to work with your project team and Operations staff to provide the quality FEED deliverables required for our clients to evaluate the economics of the project while using a lean, fit-for-purpose project team.",
    "aboutTextLine3": "Contact us to learn more about how we can provide our services to your next project.",
    "aboutTextLine4": "Fueling Success Together: EPC Solutions for the Oil & Gas Industry",
    "contactEmail": "info@denaliprojects.com",
    "contactPhone": "+1 (403) 984-6610",
    "contactAddress": "#1500, 700 - 4th Avenue SW",
    "contactCity": "Calgary, AB T2P 3J4",
    "solutionHomePage": "At Denali Projects, we specialize in a diverse array of project solutions, each tailored to meet the unique demands of the oil and gas sector as well as power generation. Our expertise spans from the well head to sales point, storage, and advanced power generation solutions. Our goal is to provide a lean, experienced, and adaptable team that guides projects from preliminary scoping through to completion and operation. With flexible pricing options, including lump sum and hourly rates, paired with our dedicated engineers, technologists, and specialists, we are equipped to tackle any challenge and drive operational excellence. Explore our project categories to discover how we can deliver innovative solutions tailored to your needs.",
    "currentPostings": "Welcome to career opportunities at Denali Projects! We are a dynamic team of professionals dedicated to delivering solutions in the Energy Industry. Explore a career with us, where your expertise and creativity will thrive in a collaborative and empowering environment. Apply today!",
    "noPostings": "Denali Projects is always looking for passionate and talented individuals. While we may not have open positions at the moment, we would love to hear from you. Join our talent pool and be the first to know when opportunities arise.",
    "apply": "Denali Projects offers exciting opportunities for professional growth, allowing individuals to work on elaborate and complex projects that shape the future of the energy industry. With a strong emphasis on collaboration, sustainability, and excellence, employees are empowered to contribute their unique skills and ideas, ensuring a fulfilling and impactful career. Apply at Denali Projects today!"
  }
]