[
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Water Disposal Facility ",
    "design": "Detailed Design, Procurement, Construction Support",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Outside Grande Prairie, AB - Greenfield",
    "description": "Denali was responsible for the design of site-wide piping, equipment packages and utilities for a greenfield water disposal terminal. Included truck in packages, tank farm, water filtration building, pump packages, multistage high pressure injection pumps, and flare system.  Included a 4km water injection pipeline and disposal well.  Reviewed the feasibility of using natural gas, propane, or diesel for power generation options. Design of the site fuel gas system (including conditioning) and sourcing generators to provide site power before permanent power was installed. Site-wide electrical design, equipment packages and electrical house for a greenfield water disposal terminal. Denali incorporated a 1.5MW utility transformer with a cable bus design to feed multiple 400HP water injection pumps. Oversaw electrical design and power studies including harmonic calculations, breaker settings, coordination curves and arc flash calculations. \n Denali would go on to expand the facility adding increased water handling capabilities, incoming water and fuel gas pipelines, and additional high pressure injection pumps, pipeline and disposal well. "
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Water Disposal Facility ",
    "design": "Detailed Design, Procurement, Construction Support",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Outside Grande Prairie, AB - Greenfield",
    "description": "Denali was responsible for the design of site-wide piping, equipment packages and utilities for a greenfield water disposal terminal. Included truck in packages, tank farm, water filtration building, pump packages, multistage high pressure injection pumps, site fuel gas system, and flare system.  Included piing to an on site disposal well.  Reviewed the feasibility of using natural gas, propane, or diesel for power generation options. Denali incorporated a 1.5MW utility transformer with a cable bus design to feed a single 400HP water injection pump. Oversaw electrical design and power studies including harmonic calculations, breaker settings, coordination curves and arc flash calculations."
  },
 {
    "section": "Conventional Facilities & Refineries",
    "project": "Propane Export Terminal",
    "design": "Detailed Design, Procurement, Construction Support",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation",
    "location": "Prince Rupert, BC – Brownfield",
    "description": "Integrated new pipe racks and marine loading arms at a brownfield location to pump refrigerated LPG from a new 95,000m3 storage tank along an existing marine jetty. Also involved in numerous scopes of work throughout the facility to integrate the different elements between rail, balance of plant and the LPG storage tank."
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Marine Terminal FEED & Regulatory Support ",
    "design": "FEED as owners engineer",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation",
    "location": "Prince Rupert, BC – Greenfield",
    "description": "Denali coordinated FEED engineering and regulatory support on behalf of their client for a greenfield marine terminal. Terminal products were LPG, Methanol and Clean Petroleum Products which are brought in by rail, stored, and pumped to ships on a new marine jetty/loading dock. The refrigerated LPG storage tank volume was 90,000m3 while the 18 total Methanol and Clean Petroleum Product tanks ranged from 30,000 to 40,000m3 in volume."
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Water Disposal Facility Expansion",
    "design": "Detailed Design, Procurement, Construction Support",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement ",
    "location": "Outside Grande Prairie, AB - Brownfield",
    "description": "Denali was responsible for an expansion to an existing water disposal facility.  Included the addition of truck in packages, tanks to an existing tank farm, water filtration building, pump packages, multistage high pressure injection pumps and integration to an existing flare system.  Included a 3km water injection pipeline and disposal well.  Denali oversaw electrical design and power studies including harmonic calculations, breaker settings, coordination curves and arc flash calculations."
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "175,000 BBL Tank Addition",
    "design": "FEED, Detailed Design, Construction Support, Procurement Support, MOC’s",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Moose Jaw, SK - Brownfield",
    "description": "Denali was responsible for the full-service engineering and procurement of a new 175,000 BBL asphalt tank to an existing refinery. This included working with the site’s existing products and utility systems, as well as tying in for tank heating. Denali also re-designed multiple existing tank farms to assist in more efficient rail and truck loading systems. Significant civil and earthwork modifications were required to the facility to accommodate the new 175,000 BBL tank including design for removal of contaminated soil, new fill and containment wall. In addition to tank farm modifications Denali expanded and modified existing MCC, E-Houses and control rooms. "
  },

{
    "section": "Conventional Facilities & Refineries",
    "project": "175,000 BBL Tank Addition",
    "design": "FEED, Detailed Design, Construction Support, Procurement Support, MOC’s",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Moose Jaw, SK - Brownfield",
    "description": "Denali was responsible for the full-service engineering and procurement of a new 175,000 BBL asphalt tank to an existing refinery. This included working with the site’s existing products and utility systems, as well as tying in for tank heating. Denali also re-designed multiple existing tank farms to assist in more efficient rail and truck loading systems. Significant civil and earthwork modifications were required to the facility to accommodate the new 175,000 BBL tank including design for removal of contaminated soil, new fill and containment wall. In addition to tank farm modifications Denali expanded and modified existing MCC, E-Houses and control rooms. "
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Trucking and Shipping Debottlenecking Project",
    "design": "FEED, Detailed Design, Construction Support, Procurement",
    "discipline": "Mechanical, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Hardisty, AB",
    "description": "Denali was responsible for the full-service engineering and procurement of a new trucking system at an existing storage and shipping facility in Hardisty Alberta. Denali completed the FEED, detailed design and execution of the project throughout construction.  The scope included a new scale, building and measurement system to replace aging infrastructure. A large part of the project was related to civil design of the new area including road additions, drainage and accessibility to accommodate additional shipping and trucking volumes."
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Trucking and Shipping Debottlenecking Project",
    "design": "FEED, Detailed Design, Construction Support, Procurement ",
    "discipline": "Mechanical, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Edmonton, AB",
    "description": "Denali was responsible for the full-service engineering and procurement of a new trucking system at an existing storage and shipping facility in Edmonton Alberta. Denali completed the FEED, detailed design and execution of the project throughout construction.  The scope included upgrades and replacement to existing building and measurement system due to aging infrastructure. "
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Refinery Electrical Distribution and Power Upgrade FEED Study",
    "design": "FEED",
    "discipline": "Civil, Structural, Electrical, Instrumentation",
    "location": "Moose Jaw, SK - Brownfield",
    "description": "Denali was responsible for the FEED study to upgrade the electrical distribution system of a 60-year-old refinery. The project consisted of as-building existing infrastructure, designing the facility upgrade to a 60% level, developing a class 3 cost estimate, level 3 schedule, procurement plan and execution strategy for the project. "
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Tank CIR Maintenance and Modification Program",
    "design": "Detailed Design, Construction Support, Procurement Support, MOC’s",
    "discipline": "Mechanical, Process, Civil, Structural, Stress Analysis, Electrical, Instrumentation, Controls and Procurement",
    "location": "Moose Jaw, SK - Brownfield",
    "description": "Denali was awarded tank cleaning, inspection and repair (CIR) maintenance and modification program for an oil refinery in Moosejaw Saskatchewan to meet regulatory compliance requirements and ensure the integrity of storage tank assets. Tanks were out of service to be cleaned and internally inspected in accordance with API 653. The program consisted of repair and modifications to nine tanks ranging from 25000 bbl to 150000 bbl. Tanks. New nozzles, steam systems, firewater systems, level and temperature measurement were added to each tank while out of service.  "
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Water Sweetening Pilot Project",
    "design": "Detailed Design, Construction Support, Procurement Support, MOC’s",
    "discipline": "Mechanical, Process, Electrical, Instrumentation, Controls and Procurement",
    "location": "Alberta - Brownfield",
    "description": "Denali assisted with development, design and construction of a water sweeting pilot project in Alberta. The package was design to remove H2S from produced water. Denali assisted with process, mechanical, instrumentation and control design and procurement."
  }


]
