[
    {
      "section":"Debottlenecking, MOC & As Building",
     "project": "180 MMSCFD Sour Gas Complex – Custody Metering ",
    "design": "Detailed Design, Construction and Commissioning Support",
    "discipline": "Electrical, Instrumentation and Controls",
    "location": "Brazeau River, Central Alberta – Brownfield",
    "description": "The client was upgrading the trucking capacity of the facility by installing four new truck loading and unloading stations. Denali's responsibilities included reviewing third-party equipment to ensure that the measurements and controls would meet regulatory and commercial requirements. As part of the design, Denali integrated the new stations into the existing electrical, controls, and communications infrastructure.",
    "image":"Automation - Moose Jaw Debottlenecking..png"
  },
    {
      "section":"Debottlenecking, MOC & As Building",
     "project": "Trucking and Shipping Debottlenecking Projects  ",
    "design": "FEED, Detailed Design, Construction Support, Procurement",
    "discipline": "Mechanical, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Hardisty, AB and Edmonton AB",
    "description": "Denali was responsible for the full-service engineering and procurement of a new trucking system at existing storage and shipping facilities in Hardisty and Edmonton, Alberta. Denali completed the FEED, detailed design, and execution of the project throughout construction. The scope included a new scale, building, and measurement system to replace aging infrastructure. A significant part of the project involved the civil design of the new area, including road additions, drainage, and accessibility improvements to accommodate increased shipping and trucking volumes.",
    "image":"Hardisty-Edmonton..png"
    },
    {
      "section":"Debottlenecking, MOC & As Building",
     "project": "Tank CIR Maintenance and Modification Program ",
    "design": "Detailed Design, Construction Support, Procurement Support, MOC’s",
    "discipline": "Mechanical, Process, Civil, Structural, Stress Analysis, Electrical, Instrumentation, Controls and Procurement",
    "location": "Moose Jaw, SK – Brownfield",
    "description": "Denali was awarded a tank cleaning, inspection, and repair (CIR) maintenance and modification program for an oil refinery in Moose Jaw, Saskatchewan, to meet regulatory compliance requirements and ensure the integrity of storage tank assets. The tanks were taken out of service for cleaning and internal inspection in accordance with API 653. The program involved repairs and modifications to nine tanks ranging from 25,000 bbl to 150,000 bbl. New nozzles, steam systems, firewater systems, and level and temperature measurement systems were added to each tank while they were out of service.",
    "image": "Tank CIR Program..png"
    },
    {
      "section":"Debottlenecking, MOC & As Building",
     "project": "TLPG Rail Unloading Debottleneck   ",
    "design": "Detailed Design, Construction Support, Procurement",
    "discipline": "Mechanical, Process, Structural, Stress Analysis, Electrical, Instrumentation, Controls and Procurement",
    "location": "Prince Rupert, BC",
    "description": "Denali was tasked with decreasing the rail unloading time for a 24-hour LPG rail unloading facility in Prince Rupert, BC. This was achieved by increasing the speed of the depressurizing system for the 28 rail loading stations, automating the depressurizing process that was previously controlled manually.",
    "image":"RIPET Rail Debottle..png"
  }

  ]
