[
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Water Disposal Facility Expansion  ",
    "design": "Detailed Design, Procurement, Construction Support ",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement ",
    "location": "Outside Grande Prairie, AB - Brownfield",
    "description": "The scope of this expansion project involved adding new truck-in packages and tanks to an existing water disposal facility. Denali facilitated the design of additional water filtration buildings, multistage high-pressure injection pumps, and integrated systems with the current flare infrastructure. The expansion included a 3 km water injection pipeline and an associated disposal well. Our team oversaw the electrical design and conducted power studies, which included harmonic calculations, breaker settings, coordination curves, and arc flash analyses."
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Water Disposal Facility ",
    "design": "Detailed Design, Procurement, Construction Support ",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement ",
    "location": "Outside Grande Prairie, AB - Greenfield  ",
    "description": "Our team was tasked with designing site-wide piping, equipment packages, and utilities for a greenfield water disposal terminal. This comprehensive project included truck-in packages, a tank farm, a water filtration building, pump packages, multistage high-pressure injection pumps, a flare system, and a 4 km water injection pipeline leading to a disposal well. We reviewed the feasibility of various power generation options, including natural gas, propane, and diesel. Additionally, the design included a fuel gas system and generators to provide temporary power before permanent installation. We incorporated a 1.5 MW utility transformer with a cable bus design to support multiple 400 HP water injection pumps. The project also encompassed electrical design and power studies, incorporating harmonic calculations, breaker settings, coordination curves, and arc flash assessments.\n Denali subsequently expanded the facility, adding increased water handling capabilities, incoming water and fuel gas pipelines, and additional high-pressure injection pumps, pipelines, and a disposal well."
  },
 {
    "section": "Conventional Facilities & Refineries",
    "project": "Water Disposal Facility ",
    "design": "Detailed Design, Procurement, Construction Support ",
    "discipline": "Mechanical, Process, Civil, Structural, Electrical, Instrumentation, Controls and Procurement",
    "location": "Outside Grande Prairie, AB - Greenfield  ",
    "description": "For this greenfield water disposal terminal, Denali focused on the design of site-wide piping, equipment packages, and utilities. The project included truck-in packages, a tank farm, a water filtration building, pump packages, and high-pressure injection pumps, along with the site fuel gas and flare systems. The infrastructure was designed to support piping leading to an on-site disposal well. The electrical design featured a 1.5 MW utility transformer with a cable bus system to operate a single 400 HP water injection pump. Comprehensive electrical studies were conducted to address harmonic calculations, breaker settings, coordination curves, and arc flash parameters."
  },
  {
    "section": "Conventional Facilities & Refineries",
    "project": "Full-Service Terminal Treater Addition  ",
    "design": "Detailed Design, Construction Support ",
    "discipline": "Mechanical, Process, Structural, Electrical, Instrumentation, and Controls",
    "location": "Outside Grande Prairie, AB - Brownfield  ",
    "description": "Our client urgently needed to add emulsion treating capacity to an existing facility. Denali reviewed available stock treaters and ancillary equipment to identify a fit-for-purpose solution that could be installed and integrated as quickly as possible. The scope included reviewing and integrating the new treater into the existing facility while maintaining the required spacing from other surrounding equipment."
  }


]
